Terraria/rapport.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-30 mar. 17:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terraria eco+</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas ROGLIN Carolina Vinkovic" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Terraria</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26c9c75">1. Le jeu</a>
<ul>
<li><a href="#orgc24fcdf">1.1. Controles</a></li>
</ul>
</li>
<li><a href="#org947cd1b">2. structure du code</a>
<ul>
<li><a href="#org2bb2bf5">2.1. structure générale</a></li>
<li><a href="#org2934809">2.2. main.js</a></li>
<li><a href="#org704b578">2.3. game.js</a></li>
<li><a href="#org043befd">2.4. collideObject</a></li>
<li><a href="#org6a05c1f">2.5. Display</a></li>
<li><a href="#orgb8db28a">2.6. generate map</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org26c9c75" class="outline-2">
<h2 id="org26c9c75"><span class="section-number-2">1</span> Le jeu</h2>
<div class="outline-text-2" id="text-1">
<p>
Le jeu se présente sous la forme d'un terraria. C'est à dire un monde 2D composé de cubes minables.
Le joueur possède un inventaire, avec de base une pioche et une épée. La pioche permet de récolter des blocs et l'épée permet de fraper les ennemis.
Le joueur à 5 pv et perd de la vie quand il se fait attaquer. Le joueur peut se protéger avec son bouclier.
Le joueur peut placer les blocs qu'il a ramassé
</p>
</div>

<div id="outline-container-orgc24fcdf" class="outline-3">
<h3 id="orgc24fcdf"><span class="section-number-3">1.1</span> Controles</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">

A            : items précedent
E            : items suivant 
Q            : Aller à gauche
D            : Aller à droite
espace       : sauter
click droit  : utiliser l'objet 
click gauche : se protéger 

</pre>
</div>
</div>
</div>

<div id="outline-container-org947cd1b" class="outline-2">
<h2 id="org947cd1b"><span class="section-number-2">2</span> structure du code</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2bb2bf5" class="outline-3">
<h3 id="org2bb2bf5"><span class="section-number-3">2.1</span> structure générale</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Ce projet est structuré selon un modèle vue contolleur un peut modfié. En effet il y a 5 fichiers principaux.
Tout d'abord le Controller.js qui va s'occuper de vérifier si une touche est préssée ou non. 
Ensuite, l'engine qui ne s'occupe que d'affciher le jeu au bon nombre de frame par seconde. 
Display.js s'occupe de dessiner tout les éléments de la scene dans un buffer puis d'afficher ce buffer à l'écran.
Game.js contient tout les éléments du jeu, en l'occurence, la map, l'inventaire, le joueur et les ennemis.
Le fichier main.js lie ensemble ses 4 fichier afin de les faires fonctionner efficacement.
</p>
</div>
</div>



<div id="outline-container-org2934809" class="outline-3">
<h3 id="org2934809"><span class="section-number-3">2.2</span> main.js</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Le main est composé de différents partie.
Tout d'abord un assetManager qui va load toute les textures puis va lancer le jeu.
Il est aussi composé de 2 fonctions importantes. la fonction render, qui va demander à la classe Render de dessiner chaque element de la scene.
Mais aussi de la fonction update, qui va tester tout les inputs possibles et si cet input est actif, il va lancer l'action correspondante. Puis il va appeler la fonction update de la classe game.js
</p>
</div>
</div>

<div id="outline-container-org704b578" class="outline-3">
<h3 id="org704b578"><span class="section-number-3">2.3</span> game.js</h3>
<div class="outline-text-3" id="text-2-3">
<p>
La fonction principale de Game.js est al fonction update dans la class World. Elle va update tout les éléments du jeu. Tout d'abord elle va mettre à jour la position de tout les ennemis.
Elle va ensuite faire attaquer les ennemis si ils sont assez proche du jouer. Elle va aussi déclencher l'attaque du joueur si l'input click gauche est activé et si le joueur a son épée en main.
Ensuite elle va mettre à jour la position de tout les ennemis et du joueur. puis elle va appeler le collider sur ces 2 dernier afin de vérifier qu'ils ne sont pas en collision avec la map, et, si oui, leur position est mit à jour.
Et pour terminer, l'animation du joueur et des ennemis est mit à jour.
</p>
</div>
</div>


<div id="outline-container-org043befd" class="outline-3">
<h3 id="org043befd"><span class="section-number-3">2.4</span> collideObject</h3>
<div class="outline-text-3" id="text-2-4">
<p>
collideObject est la fonction principale de collision. Pour s'assurer que le joueur n'est pas en collision avec une plateforme. Pour ce faire, ma fonction va récupérer la position du jouer, et calculer tout les blocs dans lequel il est.
Si il se trouve dans un bloc solide non vide, alors la position du joueur va etre changée pour qu'il n'y ai plus de collision.
</p>
</div>
</div>

<div id="outline-container-org6a05c1f" class="outline-3">
<h3 id="org6a05c1f"><span class="section-number-3">2.5</span> Display</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Display a pour role de dessiner chaque element du jeu sur une image puis de coller l'image sur l'écran. Pour cela la classe Display est composée de plusieurs fonctions. Tout d'abord la fonction draw map qui a été la plus compliquée à implémenter.
En effet, pour que le jeu le lag quand la map est grande, il n'était pas possible de dessissiner toute les tiles de la map une par une. C'est pourquoi la fonction va dessiner uniquement les blocs qui sont affichés dans la caméra afin de sauver de la puissance de calcul.
Une autre fonction importante est la fonction draw object qui va dessiner soit le joueur, soit un ennemi à une position voulue.
La fonction draw interface dessine une barre d'inventaire vide, puis chaque item de l'inventaire et enfin place un curseur à l'endroit ou se trouve l'item actif.
</p>
</div>
</div>


<div id="outline-container-orgb8db28a" class="outline-3">
<h3 id="orgb8db28a"><span class="section-number-3">2.6</span> generate map</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Pour la création de la map, une grotte type a été crée et elle est collée aléatoirement sur la map. De plus, à chaque grotte, un ennemi est ajouté dedans</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thomas ROGLIN Carolina Vinkovic</p>
<p class="date">Created: 2021-11-30 mar. 17:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
